Tekla Open API Reference for Tekla Structures 2025
PluginDescriptionAttribute Constructor
 Not supported at the moment.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginDescriptionAttribute(
	string language,
	string description
)
Public Sub New (
	language As String,
	description As String
)
Parameters
language
Type: System.String
Not supported at the moment.
description
Type: System.String
Not supported at the moment.
See Also
Reference
PluginDescriptionAttribute Class
Tekla.Structures.Plugins Namespace